Repository: quarkusio/es.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: es_es

source: About Eclipse Adoptium
es_es: Acerca de Eclipse Adoptium

source: Abstract A - All Rock'n Roll and Big Drum Solos
es_es: Resumen A - Todo Rock'n Roll y Grandes Solos de Batería

source: Abstract B - More Easy Listening
es_es: Resumen B - Escucha más fácil

source: Acknowledgement
es_es: Agradecimiento

source: Add `quarkus-jaxb` as a dependency in your Maven `pom.xml`, or Gradle `build.gradle` file.
es_es: Añade `quarkus-jaxb` como dependencia en tu archivo Maven `pom.xml`, o Gradle `build.gradle`.

source: Add the Quarkus Kubernetes extension to your build file:
es_es: Añade la extensión Quarkus Kubernetes a tu archivo de compilación:

source: Add the Quarkus gRPC xDS extension to your build file:
es_es: Añada la extensión Quarkus gRPC xDS a su archivo de construcción:

source: Add the following to your build file:
es_es: Añade lo siguiente a tu archivo de construcción:

source: Additionally, Quarkus includes extensions that make it easy to deploy serverless microservices to cloud providers including AWS Lambda, Azure Functions, and Google Cloud Functions as well as Knative to take advantage of Quarkus application’s fast startup times. <a href="{{site.baseurl}}/guides/deploying-to-kubernetes">Read the guide for more details.</a>
es_es: Además, Quarkus incluye extensiones que facilitan el despliegue de microservicios sin servidor en proveedores de la nube, como AWS Lambda, Azure Functions y Google Cloud Functions, así como Knative, para aprovechar los rápidos tiempos de inicio de las aplicaciones de Quarkus. <a href="{{site.baseurl}}/guides/deploying-to-kubernetes">Lee la guía para más detalles.</a>

source: Additionally, any additional arguments may be provided to the binding's definition by using the `arguments` key:
es_es: Además, se puede proporcionar cualquier argumento adicional a la definición del enlace utilizando la tecla `arguments`:

source: Additionally, any additional arguments may be provided to the exchange's definition by using the `arguments` key:
es_es: Además, se puede proporcionar cualquier argumento adicional a la definición del intercambio utilizando la clave `arguments`:

source: Additionally, any additional arguments may be provided to the queue's definition by using the `arguments` key:
es_es: Además, se puede proporcionar cualquier argumento adicional a la definición de la cola utilizando la tecla `arguments`:

source: Additionally, the user will have to configure which build image to use (no default image is provided). For example:
es_es: Además, el usuario tendrá que configurar qué imagen de compilación utilizar (no se proporciona ninguna imagen por defecto). Por ejemplo:

source: Adoptium has been very happy with their decision to adopt Quarkus, and are looking forward to trying out new capabilities in Quarkus like continuous testing and dev services support for MongoDB (their database of choice).
es_es: Adoptium está muy contento con su decisión de adoptar Quarkus, y está deseando probar las nuevas capacidades de Quarkus, como las pruebas continuas y el soporte de servicios de desarrollo para MongoDB (su base de datos elegida).

source: After that, push and release again:
es_es: Después, suba y publique de nuevo:

source: Again, make sure to replace `yourAccountName` with your docker or quay account name when you run `docker push`.
es_es: De nuevo, asegúrese de sustituir `yourAccountName` por el nombre de su cuenta docker o quay cuando ejecute `docker push`.

source: All
es_es: Todo

source: All `list` methods have equivalent `stream` versions.
es_es: Todos los métodos de `list` tienen versiones equivalentes de `stream`.

source: All configuration options
es_es: Todas las opciones de configuración

source: All right, so far so good, but wouldn't it be better with a few tests, just in case.
es_es: De acuerdo, hasta aquí todo bien, pero no sería mejor con unas cuantas pruebas, por si acaso.

source: All the capabilities found in an application will be aggregated during the build in an instance of `io.quarkus.deployment.Capabilities` build item, which can be injected by extension build steps to check whether a certain capability is present or not. E.g.
es_es: Todas las capacidades encontradas en una aplicación serán agregadas durante la construcción en una instancia de `io.quarkus.deployment.Capabilities` build item, que puede ser inyectada por los pasos de construcción de la extensión para comprobar si una determinada capacidad está presente o no. E.j.

source: All the techniques allowing reducing the memory usage and provide faster startup times are not only advantageous in containers. Even on bare metal, it would reduce your memory pressure, and it’s always pleasant to not have to wait 10 seconds to see your application running.
es_es: Todas las técnicas que permiten reducir el uso de la memoria y proporcionar tiempos de arranque más rápidos no sólo son ventajosas en los contenedores. Incluso en bare metal, reduciría la presión de la memoria, y siempre es agradable no tener que esperar 10 segundos para ver tu aplicación en funcionamiento.

source: Also, make sure your Heroku CLI is working:
es_es: Además, asegúrate de que tu CLI de Heroku está funcionando:

source: Alternative - Using ubi-minimal
es_es: Alternativa - Uso de ubi-minimal

source: Alternatives
es_es: Alternativas

source: Although, there is a slight limitation: since job configuration is mostly dynamic and only injected on job execution, Quarkus may fail to start due to invalid configuration (can’t find the Job configuration values). In this case, configuration injection points with the @ConfigProperty annotation need to set a default value or use an Optional.
es_es: Aunque, hay una pequeña limitación: como la configuración del trabajo es mayormente dinámica y sólo se inyecta en la ejecución del trabajo, Quarkus puede fallar al iniciar debido a una configuración inválida (no puede encontrar los valores de configuración del trabajo). En este caso, los puntos de inyección de configuración con la anotación @ConfigProperty necesitan establecer un valor por defecto o utilizar un Optional.

source: An Active Community
es_es: Una comunidad activa

source: An Open Project
es_es: Un proyecto abierto

source: An additional Quickstart
es_es: Un inicio rápido adicional

source: An implementation of the `OpenshiftBuild` could look like this:
es_es: Una aplicación de la `OpenshiftBuild` podría tener el siguiente aspecto:

source: And, in a separate terminal:
es_es: Y, en una terminal separada:

source: Any other class
es_es: Cualquier otra clase

source: Anyone can post to this list. The subscribers are only trusted individuals from the Quarkus community who will handle the resolution of any reported security issues in confidence. In your report, please note how you would like to be credited for discovering the issue and the details of any embargo you would like to impose. Currently the security response teams for the following distributions are subscribed to this list and will respond to your report:
es_es: Cualquiera puede publicar en esta lista. Los suscriptores son solo personas de confianza de la comunidad de Quarkus que se encargarán de la resolución de cualquier problema de seguridad informado de forma confidencial. En su informe, indique cómo le gustaría recibir crédito por descubrir el problema. Actualmente, los equipos de respuesta de seguridad para las siguientes distribuciones están suscritos a esta lista y responderán a su informe:

source: Apache Camel on Quarkus
es_es: Apache Camel en Quarkus

source: Apache-2.0 License
es_es: Licencia Apache-2.0

source: Apicurio Registry
es_es: Registro de Apicurio

source: Application Configuration
es_es: Configuración de la aplicación

source: Application Health & Metrics
es_es: Salud y métricas de la aplicación

source: Application requirements have changed drastically over the last few years. For any application to succeed in the era of cloud computing, Big Data, or IoT, going reactive is increasingly becoming the architecture style to follow.
es_es: Los requisitos de las aplicaciones han cambiado drásticamente en los últimos años. Para que cualquier aplicación tenga éxito en la era de la computación en la nube, el Big Data o el IoT, ser reactivo se está convirtiendo cada vez más en el estilo de arquitectura a seguir.

source: ArC comes as a dependency of `quarkus-resteasy-reactive` so you already have it handy.
es_es: ArC viene como una dependencia de `quarkus-resteasy-reactive` por lo que ya lo tienes a mano.

source: Arc, the dependency injection framework used by Quarkus, eliminates all the reflection calls and deduces the injection graph at build time. So, when the application starts, no expensive lookups; it’s done already!
es_es: Arc, el marco de inyección de dependencia utilizado por Quarkus, elimina todas las llamadas de reflexión y deduce el gráfico de inyección en tiempo de construcción. Así, cuando la aplicación se inicia, no hay búsquedas costosas; ¡ya está hecho!

source: Architectural differences
es_es: Diferencias arquitectónicas

source: Architecture
es_es: Arquitectura

source: As a Quarkus developer, you configure the Quarkus OpenID Connect (OIDC) extension by setting the following properties in the `src/main/resources/application.properties` file.
es_es: Como desarrollador de Quarkus, usted configura la extensión OpenID Connect (OIDC) de Quarkus estableciendo las siguientes propiedades en el archivo `src/main/resources/application.properties`.

source: As a consequence, it’s not possible to change the destination dynamically (using message metadata) when using RabbitMQ.
es_es: Como consecuencia, no es posible cambiar el destino dinámicamente (utilizando los metadatos del mensaje) cuando se utiliza RabbitMQ.

source: As a containerized Java program running in a container defined by the Quarkus build process
es_es: Como un programa Java en contenedor que se ejecuta en un contenedor definido por el proceso de construcción de Quarkus

source: As a containerized native program running in a container defined by the Quarkus build process
es_es: Como un programa nativo en contenedor que se ejecuta en un contenedor definido por el proceso de construcción de Quarkus

source: As a plain Java program running in a container defined by Heroku's environment
es_es: Como un programa Java simple que se ejecuta en un contenedor definido por el entorno de Heroku

source: As before, the UI is exposed on http://localhost:8080/quotes.html
es_es: Como antes, la interfaz de usuario está expuesta en http://localhost:8080/quotes.html

source: As for the reactive APIs exposed by Quarkus, stream manipulation uses the Mutiny API.
es_es: En cuanto a las APIs reactivas expuestas por Quarkus, la manipulación de flujos utiliza la API Mutiny.

source: As much as possible Quarkus tries to avoid reflection, reducing startup time and memory usage. During the built-time processing, extensions can analyze the application code and the classes available on the classpath and replace reflection calls with regular invocations. The usage of dynamic proxies is also prevented by using generating custom proxy at build time.
es_es: En la medida de lo posible, Quarkus intenta evitar la reflexión, reduciendo el tiempo de inicio y el uso de memoria. Durante el procesamiento en tiempo de construcción, las extensiones pueden analizar el código de la aplicación y las clases disponibles en el classpath y reemplazar las llamadas de reflexión con invocaciones regulares. El uso de proxies dinámicos también se evita mediante la generación de proxies personalizados en tiempo de construcción.

source: As much processing as possible is done at build time; thus, your application only contains the classes used at runtime. In traditional frameworks, all the classes required to perform the initial application deployment hang around for the application’s life, even though they are only used once. With Quarkus, they are not even loaded into the production JVM! Quarkus does not stop here. During the build-time processing, it prepares the initialization of all components used by your application. It results in less memory usage and faster startup time as all metadata processing has already been done.
es_es: Todo el procesamiento posible se realiza en el momento de la compilación; de este modo, la aplicación sólo contiene las clases utilizadas en tiempo de ejecución. En los frameworks tradicionales, todas las clases necesarias para realizar el despliegue inicial de la aplicación permanecen durante toda la vida de la misma, aunque sólo se utilicen una vez. Con Quarkus, ¡ni siquiera se cargan en la JVM de producción! Quarkus no se detiene aquí. Durante el proceso de construcción, prepara la inicialización de todos los componentes utilizados por su aplicación. El resultado es un menor uso de memoria y un tiempo de inicio más rápido, ya que todo el procesamiento de metadatos ya se ha realizado.

source: As we want to use configuration properties obtained from the Config Server, we will update the `GreetingResource` to inject the `message` property. The updated code will look like this:
es_es: Como queremos utilizar propiedades de configuración obtenidas del Servidor de Configuración, actualizaremos el `GreetingResource` para inyectar la propiedad `message`. El código actualizado tendrá el siguiente aspecto:

source: Ask on <a href="https://stackoverflow.com/questions/tagged/quarkus">Stack Overflow with the <code>quarkus</code> tag</a>
es_es: Pregunta en <a href="https://stackoverflow.com/questions/tagged/quarkus">Stack Overflow con la etiqueta <code>quarkus</code></a>

source: Ask your questions on <a href="https://stackoverflow.com/questions/tagged/quarkus">Stack Overflow</a>. After the documentation, it’s probably the best place to look for answers. We actively monitor the <a href="https://stackoverflow.com/questions/tagged/quarkus">Quarkus tag</a>.
es_es: Haz tus preguntas en <a href="https://stackoverflow.com/questions/tagged/quarkus">Stack Overflow</a>. Después de la documentación, es probablemente el mejor lugar para buscar respuestas. Vigilamos activamente la etiqueta <a href="https://stackoverflow.com/questions/tagged/quarkus">Quarkus</a>.

source: Async Reactive Types
es_es: Tipos reactivos asíncronos

source: At build time all the capabilities found in the application will be aggregated in an instance of the `io.quarkus.deployment.Capabilities` build item that extension build steps can inject to check whether a given capability is available or not.
es_es: En el momento de la compilación, todas las capacidades encontradas en la aplicación se agregarán en una instancia del elemento de compilación `io.quarkus.deployment.Capabilities` que los pasos de compilación de extensión pueden inyectar para comprobar si una determinada capacidad está disponible o no.

source: At that point you should have the following structure:
es_es: En ese momento deberías tener la siguiente estructura:

source: At this point, you should have your Quarkus container image on your Azure Container Registry. To verify, run the following command:
es_es: En este punto, deberías tener tu imagen de contenedor Quarkus en tu Azure Container Registry. Para comprobarlo, ejecuta el siguiente comando:

source: Attribute (_alias_)
es_es: Atributo _(alias_)

source: Automatic provisioning and application wiring of supporting services such as databases, identity servers, and more.
es_es: Aprovisionamiento automático y cableado de aplicaciones de servicios de apoyo como bases de datos, servidores de identidad, etc.

# Automatically add newline with `curl -w " "`
source: Automatically add newline with `curl -w "\n"`
es_es: Añadir automáticamente una nueva línea con `curl -w "\n"`

source: Available properties to customize the Redis DevService.
es_es: Propiedades disponibles para personalizar el Redis DevService.

source: Awards
es_es: Premios

source: Azure Deployment Descriptors
es_es: Descriptores de despliegue de Azure

source: Back Pressure and Credits
es_es: Presión trasera y créditos

source: Be sure to read the xref:cdi-reference.adoc#bean_discovery[Bean Discovery] section of the CDI guide for more information.
es_es: Asegúrese de leer la sección de xref:cdi-reference.adoc#bean_discovery[Bean Discovery] de la guía CDI para obtener más información.

source: Because of this, in the case of Maven, the version of the https://maven.apache.org/surefire/maven-surefire-plugin/[Surefire Maven Plugin] must be set, as the default version does not support JUnit 5:
es_es: Debido a esto, en el caso de Maven, se debe establecer la versión del https://maven.apache.org/surefire/maven-surefire-plugin/[Surefire Maven Plugin], ya que la versión por defecto no soporta JUnit 5:

source: Because starting a Kafka broker can be long, Dev Services for Kafka uses https://vectorized.io/redpanda[Redpanda], a Kafka compatible broker which starts in ~1 second.
es_es: Dado que el inicio de un broker de Kafka puede ser largo, Dev Services for Kafka utiliza https://vectorized.io/redpanda[Redpanda], un broker compatible con Kafka que se inicia en ~1 segundo.

source: Before running the application, don't forget to stop the hot reload mode (hit `CTRL+C`), or you will have a port conflict.
es_es: Antes de ejecutar la aplicación, no olvides detener el modo de recarga en caliente (pulsa `CTRL+C`), o tendrás un conflicto de puertos.

source: Before using the invoker, you first need to build your function via `mvn package`.
es_es: Antes de utilizar el invocador, primero hay que construir la función a través de `mvn package`.

source: Below is an example of (required) additional configuration when using xDS gRPC with the Istio Service Mesh in Kubernetes.
es_es: A continuación se muestra un ejemplo de configuración adicional (necesaria) cuando se utiliza xDS gRPC con Istio Service Mesh en Kubernetes.

source: Below, you can see how the container images created above can be built and deployed to AWS using the `docker` and `aws` command line tools. These instructions work for both native and jvm container images and assume that the `aws` command line tool has been logged in.
es_es: A continuación, puede ver cómo las imágenes de contenedor creadas anteriormente pueden construirse e implementarse en AWS utilizando las herramientas de línea de comandos `docker` y `aws`. Estas instrucciones funcionan tanto para imágenes de contenedor nativas como jvm y asumen que la herramienta de línea de comandos `aws` ha sido iniciada.

source: Best of Breed Libraries and Standards
es_es: Las mejores bibliotecas y estándares

source: Beyond simply working, we’re aiming for Joy.
es_es: Más allá del trabajo, nuestro objetivo es la satisfacción.

source: Books
es_es: Libros

source: Boom! Your Quarkus app is now running at <code>localhost:8080</code>
es_es: ¡Boom! Su aplicación Quarkus se ejecuta ahora en <code>localhost:8080</code>

source: Bootstrapping an application
es_es: Puesta en marcha de una aplicación

source: Bootstrapping the project
es_es: Puesta en marcha del proyecto

source: Browse through these selections of new Quarkus related books and resources to expand your knowledge and hone your coding skills to step up your Quarkus game.
es_es: Explore estas selecciones de nuevos libros y recursos relacionados con Quarkus para expandir su conocimiento y perfeccionar sus habilidades de codificación para mejorar su conocimiento de Quarkus.

source: Build
es_es: Construir

source: Build Items
es_es: Construir elementos

source: Build Time Processing
es_es: Procesamiento del tiempo de construcción

source: Build and Deploy to Google Cloud
es_es: Construir y desplegar en Google Cloud

source: Build and deploy a native Quarkus application to Kubernetes.
es_es: Construir y desplegar una aplicación nativa de Quarkus en Kubernetes.

source: Build native executables with GraalVM or Mandrel.
es_es: Construir ejecutables nativos con GraalVM o Mandrel.

source: Build the Project
es_es: Construir el proyecto

source: Build time options, handled during the application build time;
es_es: Opciones de tiempo de construcción, manejadas durante el tiempo de construcción de la aplicación;

source: Building
es_es: Construcción

source: Building Native Executables
es_es: Creación de ejecutables nativos

source: Building a container
es_es: Construir un contenedor

source: Built-in Quarkus features available in Eclipse Che incl. che.openshift.io.
es_es: Características incorporadas de Quarkus disponibles en Eclipse Che incl. che.openshift.io.

source: But you may be wondering where the URL is configured as it’s not in the code. Remember, it must not be hard-coded because the URL likely depends on the environment. The URL is configured in the application configuration:
es_es: Pero puede que te preguntes dónde está configurada la URL, ya que no está en el código. Recuerde que no debe estar codificado porque la URL probablemente depende del entorno. La URL se configura en la configuración de la aplicación:

source: But, what about streams? Generating a <em>server-sent event</em> response with Quarkus is just as simple:
es_es: Pero, ¿qué pasa con los flujos? Generar una respuesta de <em>evento enviado por el servidor</em>; con Quarkus es igual de sencillo:

source: By default, the Kubernetes resources do not contain readiness and liveness probes. To add them, import the Smallrye Health extension to your build file:
es_es: Por defecto, los recursos de Kubernetes no contienen sondas de disponibilidad y liveness. Para añadirlas, importe la extensión Smallrye Health a su archivo de compilación:

source: By the default, this extension will configure the probes to use the HTTP server (which is provided by some extensions like the Quarkus RESTEasy reactive extension). Internally, this probe will also use xref:grpc-service-implementation.adoc#health[the generated gRPC Health services].
es_es: Por defecto, esta extensión configurará las sondas para utilizar el servidor HTTP (que es proporcionado por algunas extensiones como la extensión reactiva RESTEasy de Quarkus). Internamente, esta sonda también utilizará xref:grpc-service-implementation.adoc#health[los servicios gRPC Health generados].

source: By using the `QuarkusTest` runner, you instruct JUnit to start the application before the tests.
es_es: Utilizando el runner `QuarkusTest`, se indica a JUnit que inicie la aplicación antes que las pruebas.

source: CDI Beans
es_es: Beans CDI

source: CONFIGURATION
es_es: CONFIGURACIÓN

source: CONTRIBUTORS
es_es: COLABORADORES

source: Can I write an extension?
es_es: ¿Puedo crear una extensión?

source: Capabilities produced from extension build steps aren't available for the Quarkus dev tools. As a consequences, such capabilities can not be taken into account when analyzing extension compatibility during project creation or when adding new extensions to a project.
es_es: Las capacidades producidas por los pasos de construcción de extensiones no están disponibles para las herramientas de desarrollo de Quarkus. Como consecuencia, dichas capacidades no pueden tenerse en cuenta al analizar la compatibilidad de las extensiones durante la creación del proyecto o al añadir nuevas extensiones a un proyecto.

source: Capability prefixes
es_es: Prefijos de capacidad

source: Capability promises and requirements are described in Quarkus extension descriptors - `META-INF/quarkus-extension.properties` entries of the runtime extension JAR artifacts.
es_es: Las promesas de capacidad y los requisitos se describen en los descriptores de extensión de Quarkus - `META-INF/quarkus-extension.properties` entradas de los artefactos JAR de la extensión en tiempo de ejecución.

source: Category
es_es: Categoría

source: Category: Web
es_es: Categoría: Web

source: Change Quarkus HTTP Port
es_es: Cambiar el puerto HTTP de Quarkus
